[MZPatchwork X2SoldierClassTemplate]
DisplayName = "Patchwork"
ClassSummary = "Tech specialists best known for their chaining electrical attacks, a Patchwork brings a broad array of tools to the squad."
AbilityTreeTitles[0]="Support"
AbilityTreeTitles[1]="Control"
AbilityTreeTitles[2]="Assault"
AbilityTreeTitles[3]="XCom"

RandomNickNames[0]="Numbers"
RandomNickNames[1]="Wrench"
RandomNickNames[2]="Ratchet"
RandomNickNames[3]="Shocker"
RandomNickNames[4]="Bolt"
RandomNickNames[5]="Lightning"
RandomNickNames[6]="Chains"
RandomNickNames[7]="Circuit"
RandomNickNames[8]="Jolteon"
RandomNickNames[9]="Lighthouse"
RandomNickNames[10]="Makeshift"
RandomNickNames[11]="Gizmo"
RandomNickNames[12]="Poker Player"
RandomNickNames[13]="Brain"
RandomNickNames[14]="Widget"
RandomNickNames[15]="Daffy"
RandomNickNames[16]="Spike"
RandomNickNames[17]="Discharge"
RandomNickNames[18]="Patches"
RandomNickNames[19]="Arc"
RandomNickNames[20]="Volt"
RandomNickNames[21]="Sparks"
RandomNickNames[22]="Crackle"
RandomNickNames[23]="Snap"
RandomNickNames[24]="Thunder"
RandomNickNames[25]="Crash"
RandomNickNames[26]="Storm"

RandomNickNames_Male[0]="Tesla"
RandomNickNames_Male[1]="Hammer"
RandomNickNames_Male[2]="Stripe"
RandomNickNames_Male[3]="Mohawk"
RandomNickNames_Male[4]="Lenny"
RandomNickNames_Male[5]="George"
RandomNickNames_Male[6]="Pop"

RandomNickNames_Female[0]="Biribiri"
RandomNickNames_Female[1]="Terminal"
RandomNickNames_Female[2]="Glitch"
RandomNickNames_Female[3]="Greta"
RandomNickNames_Female[4]="Frizzle"

[MZPatchworkGTSUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Patchwork: Voltaic Arc"
Summary="Upgrade our Patchwork's GREMLINs to automaticaly zap any foe that comes too close."